MAHFUZ121097/nRF52-ECG-Beat-Detection-TinyML-/main.c
/**
 * Copyright (c) 2014 - 2018, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 * Peripheral: SAADC
 * Compatibility: nRF52832 rev 2/nRF52840 rev 1, SDK 15.2.0
 * Softdevice used: S132 v6.1.0/S140 v6.1.0
 *
 * This SAADC example samples on 4 different input pins, and enables scan mode to do that. It is otherwise an
 * offsprint from the standard ble_app_uart example available in nRF5 SDK 15.2.0
 * Works together with softdevice S132 v6.1.0 on nRF52832 and S140 v6.1.0 on nRF52840
 * Transmits SAADC output to hardware UART and over BLE via Nordic UART Servive (NUS).
 * Info on NUS -> http://infocenter.nordicsemi.com/topic/com.nordic.infocenter.sdk5.v13.0.0/ble_sdk_app_nus_eval.html?cp=4_0_0_4_1_2_17
 * Info on hardware UART settings -> http://infocenter.nordicsemi.com/topic/com.nordic.infocenter.sdk5.v13.0.0/uart_example.html?cp=4_0_0_4_4_41
 */


#include <stdint.h>
#include <string.h>
#include <stdbool.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "app_error.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_drv_saadc.h"
#include "nrf_drv_ppi.h"
#include "nrf_drv_timer.h"
#include "nrf_drv_twi.h"
#include "nrf_delay.h"
#include "nrf_gpio.h"
//#include "mpu6050s.h"
//#include "Si7021.h"
#include <stdlib.h>
#include "edge-impulse-sdk/dsp/numpy_types.h"
#include "edge-impulse-sdk/porting/ei_classifier_porting.h"
#include "edge-impulse-sdk/classifier/ei_classifier_types.h"
#if defined (UART_PRESENT)
#include "nrf_uart.h"
#endif
#if defined (UARTE_PRESENT)
#include "nrf_uarte.h"
#endif

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#define APP_BLE_CONN_CFG_TAG            1                                           /**< A tag identifying the SoftDevice BLE configuration. */

#define DEVICE_NAME                     "CPS_ADC_ML2"                               /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */

#define APP_ADV_DURATION                18000                                       /**< The advertising duration (180 seconds) in units of 10 milliseconds. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */

#define SAADC_SAMPLES_IN_BUFFER         185
#define SAADC_SAMPLE_RATE               2.77                                         /**< SAADC sample rate in ms. */               

#define FEATURES_SIZE 185

// read a csv file
//for(i=0;i<21892;i++){
//  raw_features[186] = csv[i]
//}

//static double features[FEATURES_SIZE];
static float raw_features[740] = {0.627650,0.690760,0.741910,0.809550,0.842760,0.847130,0.808030,0.733740,0.622860,0.504960,0.377420,0.299030,0.254620,0.251350,0.286230,0.352800,0.400100,0.447730,0.477420,0.498150,0.499440,0.500200,0.492170,0.494290,0.493370,0.496400,0.499000,0.510300,0.502110,0.495420,0.503420,0.498130,0.495680,0.506130,0.514140,0.510960,0.521750,0.528420,0.527920,0.528120,0.535180,0.527800,0.523690,0.532200,0.527170,0.527880,0.527760,0.524870,0.524340,0.531480,0.526410,0.540930,0.546010,0.536440,0.526620,0.524690,0.516780,0.515760,0.523390,0.535650,0.540010,0.547530,0.548240,0.552100,0.546470,0.549270,0.543670,0.541800,0.536030,0.536990,0.534390,0.529580,0.531480,0.529900,0.534080,0.531370,0.530740,0.528320,0.533060,0.533250,0.530180,0.533310,0.536590,0.529110,0.525200,0.522320,0.519070,0.510330,0.520650,0.517740,0.526250,0.531260,0.541800,0.529810,0.521410,0.517310,0.508020,0.498940,0.495490,0.500090,0.490210,0.482050,0.473670,0.475000,0.466770,0.468360,0.479940,0.484570,0.491040,0.500370,0.505230,0.504100,0.504400,0.497940,0.493000,0.493570,0.496490,0.495400,0.499460,0.512200,0.512420,0.505700,0.513110,0.517790,0.508430,0.510050,0.517290,0.527840,0.527850,0.527760,0.534690,0.539960,0.532530,0.519230,0.515420,0.518470,0.508270,0.505460,0.519650,0.528060,0.524000,0.534530,0.542320,0.534400,0.533510,0.523180,0.527580,0.513530,0.514720,0.508170,0.515410,0.504790,0.517890,0.523000,0.524230,0.524770,0.525490,0.515850,0.507130,0.506770,0.497580,0.486790,0.487680,0.483860,0.484940,0.496060,0.507370,0.519230,0.534830,0.544230,0.545550,0.545030,0.528210,0.526220,0.523350,0.513080,0.519760,0.536990,0.534000,0.542050,0.553180,0.542840,0.541550,0.544740,0.544450,0.541510,0.545960,0.543930,0.534840,0.521620,0.508470,0.503150,0.494790,0.495060,0.494740,0.507730,0.513180,0.510680,0.515650,0.513040,0.504760,0.510590,0.513860,0.515240,0.514520,0.514730,0.507980,0.508230,0.510920,0.519230,0.526100,0.532770,0.542220,0.543450,0.543550,0.546150,0.539520,0.530710,0.530590,0.532290,0.518110,0.518550,0.518120,0.521410,0.515280,0.529430,0.548500,0.575540,0.614680,0.676440,0.744480,0.801720,0.838120,0.849180,0.811950,0.734660,0.621110,0.497190,0.373500,0.291160,0.250920,0.259080,0.299450,0.358690,0.416150,0.458160,0.491850,0.518520,0.523260,0.522000,0.519620,0.520830,0.506170,0.500100,0.501600,0.512820,0.509080,0.517170,0.522980,0.524100,0.519810,0.520700,0.526220,0.522250,0.513410,0.514530,0.512620,0.510960,0.522740,0.535580,0.529020,0.522540,0.527730,0.530300,0.530060,0.535150,0.549580,0.540050,0.532340,0.540010,0.540370,0.529650,0.538860,0.543110,0.532400,0.530460,0.534900,0.524930,0.523960,0.523380,0.526070,0.518360,0.515540,0.510910,0.516550,0.519310,0.518630,0.521810,0.517790,0.520310,0.520970,0.528500,0.537790,0.547710,0.543060,0.534810,0.532830,0.522700,0.514050,0.507450,0.514540,0.519090,0.521410,0.526260,0.538750,0.535840,0.527630,0.526550,0.515110,0.500510,0.489850,0.495200,0.491220,0.499280,0.496310,0.502770,0.503510,0.503310,0.502330,0.507760,0.499540,0.489970,0.488940,0.482870,0.480330,0.483580,0.497030,0.504730,0.509500,0.517710,0.527700,0.524550,0.521760,0.529800,0.530380,0.522230,0.514810,0.518130,0.509080,0.506640,0.501120,0.496600,0.496980,0.498820,0.497990,0.517530,0.530490,0.529180,0.534610,0.536520,0.529110,0.519570,0.516580,0.521400,0.516260,0.510770,0.518450,0.529700,0.525000,0.525420,0.527180,0.532640,0.515020,0.510880,0.509640,0.509810,0.505780,0.516210,0.522430,0.525250,0.524040,0.528830,0.522580,0.509650,0.517380,0.527410,0.526400,0.527740,0.532590,0.523530,0.511390,0.504240,0.501740,0.501690,0.512480,0.509660,0.508590,0.519500,0.523190,0.524450,0.541500,0.542390,0.540470,0.535740,0.524070,0.514930,0.524430,0.517220,0.522050,0.534510,0.532630,0.528210,0.535760,0.539020,0.532510,0.537060,0.534450,0.526330,0.523890,0.520170,0.515420,0.514450,0.510100,0.506510,0.498340,0.496540,0.487330,0.487080,0.472910,0.479740,0.477830,0.488810,0.496980,0.509470,0.511670,0.511850,0.498660,0.497910,0.506640,0.505390,0.508850,0.522080,0.526570,0.521200,0.527360,0.529380,0.530170,0.526180,0.522560,0.521370,0.524950,0.525040,0.522790,0.529410,0.533430,0.525670,0.532510,0.555810,0.588970,0.626820,0.699050,0.759370,0.809220,0.839070,0.836510,0.771850,0.675370,0.552410,0.414390,0.311280,0.247620,0.232200,0.264290,0.328290,0.377630,0.430440,0.468680,0.485860,0.488310,0.493060,0.505110,0.504640,0.504980,0.517730,0.517740,0.516590,0.514370,0.524010,0.512820,0.521630,0.513680,0.509160,0.502060,0.512200,0.523000,0.529990,0.542490,0.543170,0.542990,0.525830,0.526590,0.524470,0.529140,0.520540,0.531850,0.529340,0.533640,0.528760,0.529600,0.525240,0.526130,0.522160,0.533090,0.538690,0.537100,0.531380,0.538420,0.533030,0.539910,0.535290,0.533160,0.528200,0.525410,0.524760,0.531920,0.540560,0.537350,0.539690,0.535360,0.529880,0.530870,0.536890,0.544440,0.541370,0.553720,0.552110,0.549630,0.545250,0.545880,0.540570,0.539220,0.539880,0.541830,0.543610,0.533990,0.539760,0.532530,0.534400,0.537850,0.544020,0.533160,0.540250,0.527010,0.516510,0.516840,0.507610,0.498420,0.492750,0.494040,0.494540,0.508480,0.521380,0.524160,0.522720,0.518270,0.516330,0.503490,0.511800,0.516170,0.513170,0.518140,0.522010,0.515550,0.520770,0.522510,0.521210,0.526330,0.533870,0.518810,0.526330,0.518570,0.518310,0.503440,0.517360,0.515470,0.520250,0.514230,0.528050,0.528900,0.527960,0.527970,0.530210,0.523790,0.519410,0.514380,0.512360,0.519030,0.523470,0.516600,0.523750,0.527500,0.520520,0.521200,0.528710,0.521700,0.523620,0.523490,0.515420,0.505470,0.500580,0.500860,0.506170,0.515550,0.522840,0.531780,0.530050,0.527790,0.528600,0.531100,0.534770,0.536980,0.531470,0.531220,0.534000,0.539110,0.534320,0.547510,0.541230,0.539300,0.536400,0.539900,0.525220,0.530380,0.520840,0.512660,0.516560,0.515820,0.517330,0.528780,0.531310,0.527870,0.536470,0.533800,0.532370,0.532060,0.520330,0.518290,0.513600,0.508390,0.503700,0.504800,0.496340,0.498670,0.495460,0.492560,0.489650,0.486430,0.477550,0.483710,0.475980,0.482940,0.484010,0.498160,0.489630,0.492580,0.493440,0.495140,0.487880,0.492550,0.500520,0.501380,0.513100,0.520260,0.519360,0.527090,0.533100,0.528280,0.531050,0.531620,0.529760,0.527990,0.530630,0.526730,0.532780,0.522300,0.522100,0.526860,0.540240,0.574020,0.622070,0.675310,0.732500,0.789800,0.820680,0.828160,0.784970,0.705750,0.583790,0.451780,0.324230,0.242460,0.211000,0.228290,0.282290,0.361890,0.435140,0.477220,0.504710,0.508860,0.506330,0.492240,0.494850,0.494900,0.500820,0.503600,0.511310,0.512450,0.513430,0.510610,0.508040,0.515550,0.507910,0.512780,0.523520,0.524380,0.522570,0.526740,0.521440,0.522400,0.523670,0.522030,0.523610,0.535920,0.531630,0.545050,0.542090,0.540650,0.532160,0.527670,0.513490};
// static float raw_features1[185] ={1,0.758,0.112,0,0.0806,0.0785,0.0661,0.0496,0.0475,0.0351,0.031,0.0289,0.0351,0.0269,0.0393,0.0351,0.0434,0.0475,0.0537,0.0537,0.0702,0.0723,0.0847,0.0971,0.122,0.132,0.169,0.196,0.215,0.236,0.254,0.264,0.285,0.273,0.267,0.24,0.215,0.174,0.157,0.124,0.122,0.107,0.105,0.0971,0.105,0.0992,0.105,0.0992,0.107,0.107,0.116,0.112,0.122,0.112,0.12,0.112,0.114,0.112,0.122,0.105,0.107,0.101,0.101,0.0868,0.093,0.0847,0.0826,0.0785,0.0785,0.0702,0.0764,0.0682,0.0785,0.0702,0.0682,0.0682,0.0744,0.0723,0.0909,0.101,0.107,0.105,0.122,0.116,0.11,0.0971,0.103,0.0971,0.0868,0.0723,0.0702,0.0537,0.0579,0.0496,0.0579,0.0517,0.0558,0.0537,0.0537,0,0.0124,0.188,0.682,0.975,0.616,0.0413,0.0124,0.0868,0.0661,0.0661,0.0517,0.0393,0.0434,0.0331,0.0413,0.0351,0.0455,0.0413,0.0455,0.0434,0.0496,0.0475,0.064,0.0682,0,0,0.908,0.784,0.531,0.363,0.366,0.344,0.333,0.308,0.297,0.3,0.304,0.337,0.377,0.392,0.44,0.447,0.458,0.48,0.513,0.535,0.586,0.586,0.604,0.634,0.615,0.582,0.564,0.52,0.491,0.491,0.469,0.454,0.451,0.465,0.451,0.432,0.425,0.41,0.392,0.37,0.374,0.366,0.319,0.311,0.326,0.311,0.315,0.322,0.344,0.344,0.333,0.304,0.308,0.282,0.271};
float features[185];
static int counter = 0;
// si7021 initialization begins

