MAHFUZ121097/nRF52-ECG-Beat-Detection-TinyML-/main.c
  //memcpy(features, raw_features, 185 * sizeof(float));
  signal_t signal;
  signal.total_length = FEATURES_SIZE;
  //int s = get_feature_data(0,185,my_ptr);
  signal.get_data = &get_feature_data;
  ei_impulse_result_t result;
  //free(my_ptr);
  EI_IMPULSE_ERROR res = run_classifier(&signal, &result, true);
  //nrf_delay_ms(100);
//   float maxxx = result.classification[0].value*1000;
//   for(int i=0;i<5;i++){
    
//     if(result.classification[i].value>=maxxx){
//         class_result[0] = i;
//         class_result[1] = result.classification[i].value*100;
//     }
    
//   }
  class_result[0] = (result.classification[0].value*100);
  class_result[1] = (result.classification[1].value*100);
  class_result[2] = (result.classification[2].value*100);
  class_result[3] = (result.classification[3].value*100);
  class_result[4] = (result.classification[4].value*100);

//   class_result[0] = (result.classification[0].value>0.5);
//   class_result[1] = (result.classification[1].value>0.5);
//   class_result[2] = (result.classification[2].value>0.5);
//   class_result[3] = (result.classification[3].value>0.5);
//   class_result[4] = (result.classification[4].value>0.5);
  class_result[5] = res+100;
  class_result[6] = (counter/185);
  float features[] = {0};
  counter += FEATURES_SIZE;
  if(counter == 740){
    counter = 0;
   }

}

void normalize(float data[], int size){

    float min = data[0];
    float max = data[0];
    for(int i=1;i<size;++i){
        if(data[i]<min){
            min = data[i];
        }
        if(data[i]>max){
            max = data[i];
        }
    }
    for(int i=1;i<size;++i){
        data[i] = (data[i]-min) / (max-min);
    }
}

// Function to perform simple moving average smoothing for double-type data
void smoothData(float data[], int dataSize, int windowSize) {
    

    // Create a temporary array to store smoothed data
    float smoothedData[dataSize];

    // Iterate through the data array
    for (int i = 0; i < dataSize; ++i) {
        // Calculate the window boundary
        int start = i - windowSize / 2;
        int end = i + windowSize / 2;

        // Ensure the window is within bounds
        if (start < 0) {
            start = 0;
        }
        if (end >= dataSize) {
            end = dataSize - 1;
        }

        // Calculate the average within the window
        float sum = 0.0;
        for (int j = start; j <= end; ++j) {
            sum += data[j];
        }
        smoothedData[i] = sum / (end - start + 1);
    }

    // Copy the smoothed data back to the original array
    for (int i = 0; i < dataSize; ++i) {
        data[i] = smoothedData[i];
    }
}

/**@brief Application main function.
 */
int main(void)
{
    // // Specify the file path
    // const char *filePath = "C:\\Users\\CPS Lab\\Documents\\nordic_semi\\nRF5_SDK_17.0.2_d674dde\\examples\\ble_peripheral\\my_ble_adc_ML2\\mitbih_test.csv";

    // // Open the file for reading
    // FILE *file = fopen(filePath, "r");

    // // Check if the file was opened successfully
    // if (file == NULL) {
    //     fprintf(stderr, "Error opening file: %s\n", filePath);
    //     return 1; // Exit with an error code
    // }

    // // Read the file line by line
    // char line[185];

    // while (fgets(line, sizeof(line), file) != NULL) {
    //     // Process each line (you can use strtok to tokenize the CSV line)
    //     // For simplicity, let's just print the entire line in this example
    //     printf("CSV Line: %s", line);
    // }

    // // Close the file
    // fclose(file);
    nrf_gpio_cfg_output(31);
    bool erase_bonds;
    uint8_t results[7];
    static uint16_t counterr =0;
    int i;
    //uint16_t length = SAADC_SAMPLES_IN_BUFFER*2;
    //uint8_t printf_buffer[SAADC_SAMPLES_IN_BUFFER*2];
    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
// twi_master_7021_init();
// twi_master_init();
//    while (mpu6050_init()== false){
//  NRF_LOG_INFO("MPU not started.");
// }      

    saadc_sampling_event_init();
    saadc_sampling_event_enable();
    saadc_init();
    
    
advertising_start();
    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    // float features[185];

    // Enter main loop.
    for (;;)
    {
         if (NRF_LOG_PROCESS() == false){
   

       //if (data_ready==1){
            nrf_gpio_pin_set(31);
           smoothData(features,185,10);
           normalize(features,185);
           nrf_gpio_pin_clear(31);
       process_input(raw_features,results);
         nrf_delay_ms(200);  
           
           ble_nus_data_send(&m_nus, results, &length, m_conn_handle);
           
           //data_ready=0;
           //
           
       //}
         }
        idle_state_handle();
    }
}


/**
 * @}
 */
